<a href="https://colab.research.google.com/github/its-kanii/CRUD-SQL/blob/main/HR_Management_System_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#HR Management System
Let's implement CRUD operations in an HR Management System, where we manage employee records in a company database.
#Step 1: Creating the Table (CREATE)
We'll create an Employees table to store employee records.

In [ ]:
%%sql
CREATE TABLE Employees (
    EmployeeID INT PRIMARY KEY AUTO_INCREMENT,
    Name VARCHAR(100),
    Age INT,
    Gender VARCHAR(10),
    Department VARCHAR(50),
    Salary DECIMAL(10,2),
    HireDate DATE
);

#Step 2: Inserting Data (INSERT)
Let's add some employee records.

In [ ]:
%%sql
INSERT INTO Employees (Name, Age, Gender, Department, Salary, HireDate)
VALUES
('John Doe', 35, 'Male', 'IT', 75000.00, '2022-06-15'),
('Alice Smith', 28, 'Female', 'HR', 65000.00, '2023-01-10'),
('Bob Johnson', 40, 'Male', 'Finance', 80000.00, '2021-09-25');

#Step 3: Reading Data (SELECT)
Retrieve all employees.

In [ ]:
%%sql
SELECT * FROM Employees;

Retrieve employees from the HR department.

In [ ]:
%%sql
SELECT * FROM Employees WHERE Department = 'HR';

Retrieve employees hired after January 1, 2022.

In [ ]:
%%sql
SELECT * FROM Employees WHERE HireDate > '2022-01-01';

#Step 4: Updating Data (UPDATE)
Let's say Alice Smith gets promoted and her salary increases.

In [ ]:
%%sql
UPDATE Employees
SET Salary = 75000.00, Department = 'HR & Recruitment'
WHERE EmployeeID = 2;

#Step 5: Deleting Data (DELETE)
If Bob Johnson leaves the company, we remove his record.

In [ ]:
%%sql
DELETE FROM Employees WHERE Name = 'Bob Johnson';

#Final Thoughts
This example covers CRUD operations in HR Management:

* Create: We created the Employees table.

* Insert: We added employee records.

* Read: We retrieved employee data.

* Update: We updated an employee's salary and department.

* Delete: We removed an employee who left the company.